describe('repeatEventUtils', () => {
  // todo fix title
  describe('반복 유형 선택 및 생성', () => {
    it('매일 반복 일정을 생성한다', () => {});

    it('매주 반복 일정을 생성한다', () => {});

    it('매월 반복 일정을 생성한다', () => {});

    it('매년 반복 일정을 생성한다', () => {});

    it('31일에 매월 반복을 선택하면 31일에만 생성한다', () => {});

    it('윤년 29일에 매년 반복을 선택하면 29일에만 생성한다', () => {});
  });

  describe('반복 일정 표시', () => {
    it('반복 일정인지 확인한다', () => {});
  });

  describe('반복 종료 조건', () => {
    it('특정 날짜까지 반복한다', () => {});

    it('특정 횟수만큼 반복한다', () => {});

    it('종료 날짜가 없으면 지정된 기간까지 반복한다', () => {});
  });

  describe('반복 일정 단일 수정', () => {
    it('반복 일정을 수정하면 단일 일정으로 변경된다', () => {});

    it('반복 일정 표시 여부를 확인한다', () => {});
  });

  describe('반복 일정 단일 삭제', () => {
    it('반복 일정의 특정 날짜만 삭제한다', () => {});
  });
});
